CYBERPUNK_QUESTIONS = [
    {
        "text": "Началась перестрелка. Что вы сделаете?",
        "answers": [
            ("Вступлю в бой", {"combat": 3}),
            ("Взломаю систему безопасности", {"hacking": 3}),
            ("Использую технику или гаджеты", {"tech": 3}),
            ("Найду способ решить проблему через связи", {"social": 3})
        ]
    },
    {
        "text": "Что для вас ценнее всего в Найт-Сити?",
        "answers": [
            ("Боевая репутация", {"combat": 2}),
            ("Информация", {"hacking": 1, "investigation": 2}),
            ("Деньги и полезные знакомства", {"social": 3}),
            ("Свобода и возможность быть в дороге", {"mobility": 3})
        ]
    },
    {
        "text": "Ваш напарник тяжело ранен. Что будете делать?",
        "answers": [
            ("Прикрою его и устраню угрозу", {"combat": 2}),
            ("Окажу медицинскую помощь", {"medical": 3}),
            ("Организую помощь через своих людей", {"leadership": 2, "social": 1}),
            ("Быстро вывезу команду из опасной зоны", {"mobility": 3})
        ]
    },
    {
        "text": "Какую работу вы бы выбрали?",
        "answers": [
            ("Наёмник и телохранитель", {"combat": 3}),
            ("Взлом защищённой сети", {"hacking": 3}),
            ("Ремонт и создание оборудования", {"tech": 3}),
            ("Поиск компромата и расследование", {"investigation": 3})
        ]
    },
    {
        "text": "Как вы хотите влиять на Найт-Сити?",
        "answers": [
            ("Стать известным и вести людей за собой",
             {"performance": 3}),

            ("Получить власть внутри корпорации",
             {"leadership": 3}),

            ("Контролировать сделки и связи",
             {"social": 3}),

            ("Раскрывать правду",
             {"investigation": 3})
        ]
    },
    {
        "text": "Ваш главный инструмент?",
        "answers": [
            ("Оружие", {"combat": 2}),
            ("Кибердека", {"hacking": 2}),
            ("Инструменты и оборудование", {"tech": 2}),
            ("Слова, репутация и связи", {"social": 2, "performance": 1})
        ]
    }
]


CYBERPUNK_CLASS_TAGS = {
    "Рокер": {"performance": 3, "social": 1},
    "Rockerboy": {"performance": 3, "social": 1},

    "Соло": {"combat": 3},
    "Solo": {"combat": 3},

    "Нетраннер": {"hacking": 3},
    "Netrunner": {"hacking": 3},

    "Техник": {"tech": 3},
    "Tech": {"tech": 3},

    "Медтех": {"medical": 3, "tech": 1},
    "Medtech": {"medical": 3, "tech": 1},

    "Медиа": {"investigation": 3, "social": 1},
    "Media": {"investigation": 3, "social": 1},

    "Корпорат": {"leadership": 3, "social": 1},
    "Exec": {"leadership": 3, "social": 1},

    "Законник": {"combat": 1, "leadership": 2},
    "Lawman": {"combat": 1, "leadership": 2},

    "Фиксер": {"social": 3},
    "Fixer": {"social": 3},

    "Кочевник": {"mobility": 3},
    "Nomad": {"mobility": 3}
}
