FANTASY_QUESTIONS = [
    {
        "text": "Как вы предпочитаете решать проблемы?",
        "answers": [
            ("Силой", {"warrior": 2}),
            ("Магией или знаниями", {"magic": 2}),
            ("Хитростью", {"stealth": 2}),
            ("Переговорами и помощью другим", {"support": 2})
        ]
    },
    {
        "text": "Какой стиль боя вам ближе?",
        "answers": [
            ("Ближний бой", {"warrior": 2}),
            ("Заклинания и необычные способности", {"magic": 2}),
            ("Скрытность и точные атаки", {"stealth": 2}),
            ("Поддержка союзников", {"support": 2})
        ]
    },
    {
        "text": "Что для вас важнее всего?",
        "answers": [
            ("Сила и выносливость", {"warrior": 2}),
            ("Интеллект и знания", {"magic": 2}),
            ("Ловкость и осторожность", {"stealth": 2}),
            ("Харизма и взаимодействие с людьми", {"support": 2})
        ]
    },
    {
        "text": "Группа попала в опасную ситуацию. Что вы сделаете?",
        "answers": [
            ("Встану впереди и приму удар на себя",
             {"warrior": 2, "support": 1}),

            ("Попытаюсь найти магическое решение",
             {"magic": 2}),

            ("Попытаюсь незаметно обойти противника",
             {"stealth": 2}),

            ("Помогу группе и продумаю общий план",
             {"support": 2})
        ]
    },
    {
        "text": "Какой герой вам интереснее?",
        "answers": [
            ("Могучий воин", {"warrior": 2}),
            ("Таинственный маг или учёный", {"magic": 2}),
            ("Ловкий авантюрист", {"stealth": 2}),
            ("Лидер или защитник команды", {"support": 2})
        ]
    }
]


FANTASY_CLASS_TAGS = {
    "Воин": {"warrior": 3},
    "Варвар": {"warrior": 3},
    "Паладин": {"warrior": 2, "support": 2},
    "Монах": {"warrior": 2, "stealth": 1},
    "Следопыт": {"warrior": 1, "stealth": 2},
    "Плут": {"stealth": 3},
    "Убийца": {"stealth": 3},
    "Истребитель": {"warrior": 2, "stealth": 1},

    "Волшебник": {"magic": 3},
    "Чародей": {"magic": 3},
    "Ведьма": {"magic": 3},
    "Магус": {"warrior": 2, "magic": 2},
    "Арканист": {"magic": 3},
    "Кинетик": {"magic": 2, "warrior": 1},

    "Жрец": {"magic": 1, "support": 3},
    "Друид": {"magic": 2, "support": 1},
    "Бард": {"magic": 1, "support": 3},
    "Шаман": {"magic": 2, "support": 2},
    "Оракул": {"magic": 2, "support": 2},
    "Воин-жрец": {"warrior": 2, "support": 2},

    # BG3
    "Колдун": {"magic": 3},
    "Клирик": {"magic": 1, "support": 3}
}

